jcwang4/ME461_Lab_Repo/ME461_FinalProject/workspace/quadStarter_f28027/quad_main.c
    if(calibration_state == 0){
        calibration_count++;

        if (calibration_count == 400) {
            calibration_state = 1;
            calibration_count = 0;
        }
    } else if(calibration_state == 1){

        accelx_offset+=accelx;
        accely_offset+=accely;
        accelz_offset+=accelz;

        gyrox_offset+=gyrox;
        gyroy_offset+=gyroy;
        gyroz_offset+=gyroz;


        calibration_count++;
        if (calibration_count == 400) {
            calibration_state = 2;
            accelx_offset/=400.0;
            accely_offset/=400.0;
            accelz_offset/=400.0;
            gyrox_offset/=400.0;
            gyroy_offset/=400.0;
            gyroz_offset/=400.0;
            calibration_count = 0;
        }

    } else if(calibration_state == 2){
        accelx = accelx - (accelx_offset);
        accely = accely - (accely_offset);
        accelz = accelz - (accelz_offset)+1;
        print_accelx = accelx;
        print_accely = accely;
        print_accelz = accelz;
        gyrox  = gyrox - gyrox_offset;
        gyroy  = gyroy - gyroy_offset;
        gyroz  = gyroz - gyroz_offset;
        print_gyrox = gyrox;
        print_gyroy = gyroy;
        print_gyroz = gyroz;
        //            mpu_roll = atan2(accely, accelz);
        //            mpu_pitch = atan2(-accelx, sqrt(accely*accely + accelz*accelz) );

        // This is the Working Madgwick Algorithm -Ramya
//        MadgwickAHRSupdateIMU(Quaternions, DotQuaternions, mdg_beta,
//                              (PI/180.0)*gyrox,
//                              (PI/180.0)*gyroy,
//                              (PI/180.0)*gyroz,
//                              accelx, accely, accelz);
//
//        q0 = Quaternions[0];
//        q1 = Quaternions[1];
//        q2 = Quaternions[2];
//        q3 = Quaternions[3];
//
//        R11 = 2.0*q0*q0 -1 + 2.0*q1*q1;
//        R21 = 2.0*(q1*q2 - q0*q3);
//        R31 = 2.0*(q1*q3 + q0*q2);
//        R32 = 2.0*(q2*q3 - q0*q1);
//        R33 = 2.0*q0*q0 -1 + 2.0*q3*q3;
//
//
//        //            Added - signs to angles
//        roll_tilt =-1* atan2( R32, R33 );
//        pitch_tilt = -1 * -atan( R31 / sqrt(1-R31*R31) );
//        yaw_tilt =-1 *  atan2( R21, R11 );

        //Measurements from gyroscope
        pitch_tiltrate = (gyroy*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s
        roll_tiltrate = (gyrox*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s
        yaw_tiltrate = (gyroz*PI)/180.0; //z-axis: (gyroz*PI)/180.0; //y-axis: (gyroy*PI)/180.0; //x-axis: (gyrox*PI)/180.0; // rad/s

//        FT = 50;
//            f1_x = FT * sin(pitch_tilt);
////            f1_y = -FT *
//
////                    Motor commands A1, B1, A2, B2
//
//
//
//            k_F = 0;
//            k_M = 0;
////            length rotor to CoM (m)
//            l = 0.0916






        w_y = -pitch_tiltrate;
        w_x = - roll_tiltrate;
        w_z = yaw_tiltrate;

//        thetaError = -pitch_tilt;

        theta_k = theta_k_1 + w_y * T_s;
        phi_k = phi_k_1 + w_x * T_s;
        psi_k = psi_k_1 + w_z * T_s;

//        When accelx = 1, theta = 1.57 (pi/2)
        theta_est = 0.9*(0.9*theta_k + 0.1* theta_k_1)+ 0.157 * accelx;
        phi_est = 0.9*(0.9*phi_k + 0.1* phi_k_1)+ 0.157 * accely;
        psi_est = 0.9*(0.9*psi_k + 0.1* psi_k_1);

        if((theta_est > PI / 2) || (theta_est < - PI / 2)){
            integralThetaError = integralThetaError_1;
        }
        else{
            integralThetaError = integralThetaError_1 + (theta_est + theta_est_1) / 2;
        }

        if((phi_est > PI / 2) || (phi_est < - PI / 2)){
            integralPhiError = integralPhiError_1;
        }
        else{
            integralPhiError = integralPhiError_1 + (phi_est + phi_est_1) / 2;
        }


        tau_x = -Kp_x * (phi_est) -Kd_x * (w_x) - Ki_x * integralPhiError;
        tau_y = -Kp_y * (theta_est) -Kd_y * (w_y) - Ki_y * integralThetaError;
        tau_z = -Kp_z * (psi_est) -Kd_z * (w_z);
        F_z = 1500;

        A1 = tau_y*65  + tau_z *20 + F_z;
        A2 = -tau_y*65 + F_z + tau_z *20;
        B1 = tau_x * 65 + F_z - tau_z *20;
        B2 = -tau_x * 65 + F_z - tau_z *20;



//        A1 = tau_z *40;
//        A2 = tau_z *40;
//        B1 = -tau_z *40;
//        B2 = -tau_z *40;


        if(A1 > 3000){
            A1 = 3000;
        }
        else if(A1 <0){
            A1 = 0;
        }
        if(B1 > 3000){
            B1 = 3000;
        }
        else if(B1 <0){
            B1 = 0;
        }
        if(A2 > 3000){
            A2 = 3000;
        }
        else if(A2 <0){
            A2 = 0;
        }
        if(A2 > 3000){
            A2 = 3000;
        }
        if(B2 <0){
            B2 = 0;
        }
        else if(B2 > 3000){
            B2 = 3000;
        }

//        A1 = 0;
//        A2 = 0;
//        B1 = 0;
//        B2 = 0;
//        EPwm1Regs.CMPA.half.CMPA = A1;
//        EPwm1Regs.CMPB = B1;
//        EPwm2Regs.CMPA.half.CMPA = A2;
//        EPwm2Regs.CMPB = B2;

        EPwm1Regs.CMPA.half.CMPA = A1;
        EPwm2Regs.CMPB = A2;

        EPwm1Regs.CMPB = B1;
        EPwm2Regs.CMPA.half.CMPA = B2;


//        EPwm1Regs.CMPA.half.CMPA = 0;
//        EPwm1Regs.CMPB = 0;
//        EPwm2Regs.CMPA.half.CMPA = 0;
//        EPwm2Regs.CMPB = 0;

//        thetaError_1 = thetaError;
        theta_est_1 = theta_est;
        theta_k_1 = theta_k;
        phi_est_1 = phi_est;
        phi_k_1 = phi_k;
        psi_est_1 = psi_est;
        psi_k_1 = psi_k;

//        integralPhiError_1 = integralPhiError;
//        integralThetaError_1 = integralThetaError;

//        EPwm1Regs.CMPA.half.CMPA = A1;
//        EPwm1Regs.CMPB = B1;
//        EPwm2Regs.CMPA.half.CMPA = A2;
//        EPwm2Regs.CMPB = B2;
    }

    numSWIcalls++;

    GpioDataRegs.GPACLEAR.bit.GPIO5 = 1;
    DINT;

}

__interrupt void adc_isr(void)
{

//    GpioDataRegs.GPASET.bit.GPIO5 = 1;
    ADC0raw = AdcResult.ADCRESULT0;
    ADC2raw = AdcResult.ADCRESULT1;

    ADCcount++;
    if ((ADCcount%50)==0) {
        GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    }

    if (SPI_Interrupt_Finished == 1) {
        SPI_Interrupt_Finished = 0;
        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;

        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x3A00));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SPIenc_state = 4;
    }



    //
    // Clear ADCINT1 flag reinitialize for next SOC
    //
    AdcRegs.ADCINTFLGCLR.bit.ADCINT1 = 1;

    //
    // Acknowledge interrupt to PIE
    //
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;

