jcwang4/ME461_Lab_Repo/ME461_FinalProject/workspace/quadStarter_f28027/quad_main.c
}




//
// cpu_timer0_isr -
//
__interrupt void cpu_timer0_isr(void)
{
    Timer0Count++;



    if (Timer0Count > 32000) { // Rolls over at 32767 so catch before that point
        Timer0Count = 0;
    }
   // GpioDataRegs.GPBTOGGLE.bit.GPIO34 = 1;
    if((Timer0Count % 3) == 0){
    UARTPrint = 1;
    }
    //
    // Acknowledge this interrupt to receive more interrupts from group 1
    //
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}

//
// cpu_timer1_isr -
//
__interrupt void cpu_timer1_isr(void)
{
    CpuTimer1.InterruptCount++;

    //
    // The CPU acknowledges the interrupt
    //
    EDIS;
}

//
// cpu_timer2_isr -
//
__interrupt void cpu_timer2_isr(void)
{
    EALLOW;
    CpuTimer2.InterruptCount++;

    //
    // The CPU acknowledges the interrupt.
    //
    EDIS;
}

//// This function is called each time a char is recieved over UARTA.
//void serialRXA(serial_t *s, char data) {
//    numRXA ++;
//
//}

void SPI_RXint(void) {

    uint16_t i;

    switch (SPIenc_state) {
    case 4:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        AccelXraw = readdata[1];
        AccelYraw = readdata[2];
        AccelZraw = readdata[3];

        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x4200));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SPIenc_state = 5;
        break;
    case 5:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        gyroXraw = readdata[1];
        gyroYraw = readdata[2];
        gyroZraw = readdata[3];

        SpiaRegs.SPIFFRX.bit.RXFFIL = 4;
        GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;

        SpiaRegs.SPITXBUF = ((0x8000)|(0x4A00));
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;
        SpiaRegs.SPITXBUF = 0;

        SPIenc_state = 6;

        break;
    case 6:
        GpioDataRegs.GPASET.bit.GPIO19 = 1;                 //Pull CS high as done R/W
        for (i=0; i<4; i++) {
            readdata[i] = SpiaRegs.SPIRXBUF; // readdata[0] is garbage
        }
        mx = (float)readdata[1];
        my = (float)readdata[2];
        mz = (float)readdata[3];

        SPI_Interrupt_Finished = 1;
        PieCtrlRegs.PIEIFR12.bit.INTx8 = 1;
        break;

    }

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=0){
        temp = SpiaRegs.SPIRXBUF;
    }

    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR=1;  // Clear Overflow flag
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR=1;  // Clear Interrupt flag

    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE

}



//
// End of File
//
void setupSpia(void)        //for mpu9250
{
    EALLOW;
    GpioCtrlRegs.GPAPUD.bit.GPIO16 = 0;    // Enable pull-up on GPIO16 (SIMO)
    GpioCtrlRegs.GPAMUX2.bit.GPIO16 = 1;   // Configure GPIO16 as SIMO

    GpioCtrlRegs.GPAPUD.bit.GPIO17 = 0;    // Enable pull-up on GPIO17 (SOMI)
    GpioCtrlRegs.GPAMUX2.bit.GPIO17 = 1;   // Configure GPIO17 as SOMI

    GpioCtrlRegs.GPAPUD.bit.GPIO18 = 0;    // Enable pull-up on GPIO18 (CLK)
    GpioCtrlRegs.GPAMUX2.bit.GPIO18 = 1;   // Configure GPIO18 as CLK

    GpioCtrlRegs.GPAMUX2.bit.GPIO19 = 0;
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    GpioCtrlRegs.GPADIR.bit.GPIO19 = 1;
    GpioCtrlRegs.GPAPUD.bit.GPIO19 = 1;

    EDIS;

    EALLOW;
    GpioCtrlRegs.GPAQSEL2.bit.GPIO16 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    GpioCtrlRegs.GPAQSEL2.bit.GPIO17 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    GpioCtrlRegs.GPAQSEL2.bit.GPIO18 = 3; // Set I/O pin to asynchronous mode recommended for SPI
    EDIS;

    SpiaRegs.SPICCR.bit.SPISWRESET   = 0;    // Put SPI in Reset

    SpiaRegs.SPICTL.bit.CLK_PHASE    = 1;
    SpiaRegs.SPICCR.bit.CLKPOLARITY  = 0;

    SpiaRegs.SPICTL.bit.MASTER_SLAVE = 1;    // SPI master
    SpiaRegs.SPICCR.bit.SPICHAR      = 0xF;  // Set to transmit 16 bits
    SpiaRegs.SPICTL.bit.TALK         = 1;    // Enables transmission for the 4-pin option
    SpiaRegs.SPIPRI.bit.FREE         = 1;    // Free run, continue SPI operation
    SpiaRegs.SPICTL.bit.SPIINTENA    = 0;    // Disables the SPI interrupt

    SpiaRegs.SPIBRR = LSPCLK_HZ/1000000L - 1;

    SpiaRegs.SPISTS.all              = 0x0000;

    SpiaRegs.SPIFFTX.bit.SPIRST      = 1;    // SPI FIFO can resume transmit or receive.
    SpiaRegs.SPIFFTX.bit.SPIFFENA    = 1;    // SPI FIFO enhancements are enabled
    SpiaRegs.SPIFFTX.bit.TXFIFO      = 0;    // Write 0 to reset the FIFO pointer to zero, and hold in reset
    SpiaRegs.SPIFFTX.bit.TXFFINTCLR  = 1;    // Write 1 to clear SPIFFTX[TXFFINT] flag

    SpiaRegs.SPIFFRX.bit.RXFIFORESET = 0;    // Write 0 to reset the FIFO pointer to zero, and hold in reset
    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR  = 1;    // Write 1 to clear SPIFFRX[RXFFOVF]
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR  = 1;    // Write 1 to clear SPIFFRX[RXFFINT] flag
    SpiaRegs.SPIFFRX.bit.RXFFIENA    = 1;    // RX FIFO interrupt based on RXFFIL match

    SpiaRegs.SPIFFCT.bit.TXDLY       = 0; // The next word in the TX FIFO buffer is transferred to SPITXBUF immediately upon completion of transmission of the previous word.

    SpiaRegs.SPICCR.bit.SPISWRESET   = 1;    // Pull the SPI out of reset

    SpiaRegs.SPIFFTX.bit.TXFIFO      = 1;    // Release transmit FIFO from reset.
    SpiaRegs.SPIFFRX.bit.RXFIFORESET = 1;    // Re-enable receive FIFO operation
    SpiaRegs.SPICTL.bit.SPIINTENA    = 0;    // Disable the SPI interrupt.
    SpiaRegs.SPIFFRX.bit.RXFFIL      = 4;    // A RX FIFO interrupt request is generated when there are 1 or more words in the RX buffer.

    //-----------------------------------------------------------------------------------------------------------------

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (0x1300         | 0x00); // 0x1300 (0x0000)
    SpiaRegs.SPITXBUF = (0x0000         | 0x00); // 0x1400 (0x0000),       0x1500 (0x0000)
    SpiaRegs.SPITXBUF = (0x0000         | 0x00); // 0x1600 (0x0000),       0x1700 (0x0000)
    SpiaRegs.SPITXBUF = (0x0000         | 0x13); // 0x1800 (0x0000),       0x1900 (0x0013)

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=4);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);
    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (0x1A00         | 0x02); //0x1A00 (0x0002),

