jcwang4/ME461_Lab_Repo/ME461_FinalProject/workspace/quadStarter_f28027/quad_main.c
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);
    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (0x1B00         | 0x00); // 0x1B00 (0x0000), 250 dps
    SpiaRegs.SPITXBUF = (0x0800         | 0x06); // 0x1C00 (0x0008), +-4g, 0x1D00 (0x0006), 5Hz
    SpiaRegs.SPITXBUF = (0x0000         | 0x00); // 0x1E00 (0x0000),       0x1F00 (0x0000)

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=3);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (FIFO_EN        | 0x0000); // 0x2300 (0x0000)
    SpiaRegs.SPITXBUF = (0x4000         | 0x008C); // 0x2400 (0x0040),       0x2500 (0x008C)
    SpiaRegs.SPITXBUF = (0x0100         | 0x00D8); // 0x2600 (0x0001),       0x2700 (0x00D8)
    SpiaRegs.SPITXBUF = (0x0C00         | 0x000A); // 0x2800 (0x000C),       0x2900 (0x000A)
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=4);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (I2C_SLV1_CTRL | 0x0081);  // 0x2A00 (0x0081)
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (INT_ENABLE | 0x0001);  // 0x3800
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (INT_STATUS | 0x0001);  // 0x3A00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (I2C_SLV1_DO | 0x0001);  // 0x6400
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (I2C_MST_DELAY_CTRL | 0x0003); // 0x6700
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (USER_CTRL | 0x0020);  // 0x6A00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (PWR_MGMT_1 | 0x0001); // 0x6B00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (WHO_AM_I | 0x0071);  // 0x7500
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (XA_OFFSET_H | 0x13); // 0x7700
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (XA_OFFSET_L | 0x22); // 0x7800
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (YA_OFFSET_H | 0xE6); // 0x7A00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (YA_OFFSET_L | 0x18); // 0x7B00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (ZA_OFFSET_H | 0x0021); // 0x7D00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    DELAY_US(10);

    GpioDataRegs.GPACLEAR.bit.GPIO19 = 1;
    SpiaRegs.SPITXBUF = (ZA_OFFSET_L | 0x0050); // 0x7E00
    while(SpiaRegs.SPIFFRX.bit.RXFFST !=1);
    GpioDataRegs.GPASET.bit.GPIO19 = 1;
    temp = SpiaRegs.SPIRXBUF;

    while(SpiaRegs.SPIFFRX.bit.RXFFST !=0){
        temp = SpiaRegs.SPIRXBUF;
    }

    DELAY_US(50);

    SpiaRegs.SPICTL.bit.SPIINTENA = 0;
    SpiaRegs.SPIFFRX.bit.RXFFOVFCLR = 1;
    SpiaRegs.SPIFFRX.bit.RXFFINTCLR = 1;
    SpiaRegs.SPIFFRX.bit.RXFFIENA = 1;

    PieCtrlRegs.PIEACK.all = PIEACK_GROUP6;   // Acknowledge interrupt to PIE
    PieCtrlRegs.PIEIER6.bit.INTx1 = 1;  //Enable PIE 6.1 interrupt
}
